app/controllers/game_controller.rb

SELECT  "seasons".* FROM "seasons"  WHERE "seasons"."id" = $1 LIMIT 1  [["id", 4]]
INSERT INTO "games" ("created_at", "date", "location", "opponent", "season_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", "2014-10-07 22:31:27.591533"], ["date", "2014-10-18 05:00:00.000000"], ["location", "Home"], ["opponent", "Duke"], ["season_id", 4], ["updated_at", "2014-10-07 22:31:27.591533"]]
---
  def create
    # @user = User.find(session[:user_id])
    @season = Season.find(game_params[:season_id])
    @game = @season.games.new(game_params)

    if @game.save

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "games".* FROM "games"  WHERE "games"."id" = $1 LIMIT 1  [["id", 0]]
SELECT "stats".* FROM "stats"  WHERE "stats"."game_id" = 1 AND "stats"."stat_type" = 1
---
  def show
    @user = User.find(session[:user_id])
    @game = Game.find(params[:id])
    @missed_shots = Stat.where(game_id: params[:id], stat_type: 1)

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "games".* FROM "games"  WHERE "games"."id" = $1 LIMIT 1  [["id", 1]]
---
  def edit
    @user = User.find(session[:user_id])
    @game = Game.find(params[:id])

SELECT  "games".* FROM "games"  WHERE "games"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "games" SET "gameover" = $1, "updated_at" = $2, "win" = $3 WHERE "games"."id" = 1  [["gameover", "t"], ["updated_at", "2014-10-07 22:22:17.140932"], ["win", "W"]]
---
  def update #post for edit
    @game = Game.find(params[:id])
    @user = User.find(session[:user_id])
      if params[:win] == 'win'
        @game.update(win: "W", gameover: true)