app/controllers/season_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "teams".* FROM "teams"  WHERE "teams"."id" = $1 LIMIT 1  [["id", 2]]
INSERT INTO "seasons" ("created_at", "name", "team_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-10-07 22:30:08.654668"], ["name", "2015"], ["team_id", 2], ["updated_at", "2014-10-07 22:30:08.654668"]]
---
  def create
    @user = User.find(session[:user_id])
    @team = Team.find(season_params[:team_id])
    @season = @team.seasons.new(season_params)

    if @season.save