app/controllers/stat_controller.rb

SELECT  "games".* FROM "games"  WHERE "games"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "stats" ("created_at", "game_id", "made", "stat_type", "updated_at", "x_coord", "y_coord") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["created_at", "2014-10-07 22:21:43.718747"], ["game_id", 1], ["made", "t"], ["stat_type", 2], ["updated_at", "2014-10-07 22:21:43.718747"], ["x_coord", 719], ["y_coord", 93]]
---
  def create
    @game = Game.find(params[:game_id])
    @stats = @game.stats.new(stat_params)
    if @stats.save

SELECT  "games".* FROM "games"  WHERE "games"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show_all
    @game = Game.find(params[:id])