app/controllers/team_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
INSERT INTO "teams" ("created_at", "name", "school", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-10-07 22:30:50.884141"], ["name", "Varsity"], ["school", "Michigan"], ["updated_at", "2014-10-07 22:30:50.884141"], ["user_id", 2]]
---
  def create
    @user = User.find(session[:user_id])
    #@team = Team.new(params[:team_params])
    @team = @user.teams.new(team_params)
    if @team.save