app/controllers/user_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
---
  def index
    if session[:user_id] != nil
    redirect_to user_path(User.find(session[:user_id]))

INSERT INTO "users" ("created_at", "email", "name", "password_digest", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if @user.save

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "teams".* FROM "teams"  WHERE "teams"."user_id" = 1
---
   def show_all_teams
    @user = User.find(session[:user_id])
    @teams = Team.where(user_id: @user.id)

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "teams".* FROM "teams"  WHERE "teams"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show_all_team_seasons
    @user = User.find(session[:user_id])
    @team = Team.find(params[:team_id])

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "seasons".* FROM "seasons"  WHERE "seasons"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "games".* FROM "games"  WHERE "games"."season_id" = $1  ORDER BY date desc  [["season_id", 1]]
---
  def show_all_season_games
    @user = User.find(session[:user_id])
    @season = Season.find(params[:season_id])
    @games = @season.games.order('date desc')

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "teams".* FROM "teams"  WHERE "teams"."user_id" = $1  [["user_id", 1]]
---
  def show
    @user = User.find(session[:user_id])
    @teams = @user.teams #Team.where(user_id: @user.id)
    #@seasons = @teams.first.seasons #Season.where(season_id: @teams)
    @seasons = []
    @teams.each do |team|